{
    "text_kerala": "Kerala, located in the southwestern region of India, is known for its lush landscapes and extensive backwaters. The Western Ghats, a UNESCO World Heritage Site, run parallel to the coast and are rich in biodiversity, offering a haven for numerous endemic species. The state's coastline along the Arabian Sea features beautiful sandy beaches and tranquil lagoons. Inland, the backwaters, including the famous Vembanad Lake, form a unique network of interconnected canals, rivers, and lakes. This serene waterway system is a significant attraction for houseboat tourism. Additionally, Kerala's tropical climate supports expansive tea, coffee, and spice plantations in the hill stations of Munnar and Wayanad. The state's geography is a blend of highlands, midlands, and lowlands, creating a diverse and picturesque environment.",
    "text_rajasthan": "Rajasthan, located in the northwestern part of India, is known for its vast deserts and majestic forts. The Thar Desert, also known as the Great Indian Desert, dominates the landscape, offering rolling sand dunes and sparse vegetation. Despite the arid conditions, the desert is home to a variety of flora and fauna, adapted to the harsh environment. The Aravalli Range, one of the oldest mountain ranges in the world, runs diagonally across the state, providing a contrasting green terrain and influencing the climate. Rajasthan's geography is dotted with numerous palaces, forts, and havelis, with cities like Jaipur, Udaipur, and Jaisalmer showcasing splendid architecture amidst the rugged landscape. The state also features several lakes, such as Lake Pichola in Udaipur, which add to its scenic beauty. Additionally, the region experiences extreme temperatures, with hot summers and cold winters, making its geographical features even more striking.",
    "text_assam": "Assam, situated in northeastern India, is characterized by its lush greenery, rolling hills, and the mighty Brahmaputra River. The Brahmaputra, one of the major rivers of the world, flows through the length of the state, creating fertile plains and numerous riverine islands, including Majuli, the world's largest river island. Assam is also home to the lush tea gardens of the Assam Valley, producing some of the finest tea globally. The state is encircled by hills and mountains, including the Eastern Himalayas and the Patkai Hills, which contribute to its varied topography. Kaziranga National Park, a UNESCO World Heritage Site, is famous for its population of the endangered one-horned rhinoceros and rich biodiversity. The region's subtropical climate ensures dense forests and rich wildlife, making it a significant area for conservation. Assam's geography, with its rivers, hills, and forests, presents a vibrant and diverse natural environment."
  }